{
    "navbar": {
        "home": "Home",
        "about": "Sobre",
        "projects": "Projetos",
        "skills": "Habilidades",
        "contact": "Contato"
    },
    "home": {
        "greeting": "Davi Passos",
        "subheading1": "Desenvolvedor Web",
        "subheading2": "Entusiasta de UI/UX",
        "subheading3": "Desenvolvedor Unity",
        "subheading4": "Transformando Ideias em Realidade",
        "description": "Sou um desenvolvedor apaixonado por criar experiências digitais envolventes e funcionais. Vamos construir algo incrível juntos!",
        "button": "Veja meus projetos"
    },
    "about": {
        "title": "Sobre Mim",
        "bio1": "Olá! Sou o Davi Passos. Minha paixão é construir pontes entre a lógica e a criatividade para criar soluções digitais. Com uma base em Análise de Sistemas e iniciando uma graduação em Matemática pela UNIFEI, sou fascinado por resolver problemas complexos e transformá-los em experiências intuitivas para as pessoas.",
        "bio2": "Além dos projetos formais, meu playground criativo é o desenvolvimento de jogos, onde exploro novas mecânicas e narrativas. Também dedico tempo a projetos de código aberto e estou sempre em busca do próximo quebra-cabeça de código para resolver.",
        "button": "Vamos Conversar",
        "philosophyTitle": "Minha Filosofia",
        "philosophy1Title": "Pessoas em Primeiro Lugar",
        "philosophy1Desc": "No fim do dia, a tecnologia é sobre pessoas. Um código bonito é legal, mas um código que ajuda de verdade é o que me move.",
        "philosophy2Title": "Solução de Problemas",
        "philosophy2Desc": "Eu genuinamente amo o processo de desvendar um problema. A busca pela solução, os testes, os erros e, finalmente, aquele momento 'a-há!' quando tudo se encaixa... essa sensação é incrível.",
        "philosophy3Title": "Aprendendo Juntos",
        "philosophy3Desc": "Não tenho todas as respostas, e acho ótimo que seja assim. Acredito em um ambiente onde pedir ajuda é normal e ensinar o que se sabe é um presente. É na troca de ideias que as melhores soluções nascem.",
        "journeyTitle": "Minha Jornada",
        "journey1Date": "2024 - Base Técnica",
        "journey1Title": "Ensino Médio Focado em TI",
        "journey1Desc": "Concluí o ensino médio com uma formação integrada, que me proporcionou a base em programação, web design e hardware (Arduino), despertando minha paixão pela tecnologia.",
        "journey2Date": "2025 - Aprofundamento Acadêmico",
        "journey2Title": "Técnico pelo SENAI e Graduando na UNIFEI",
        "journey2Desc": "Formei-me Técnico em Análise e Desenvolvimento de Sistemas pelo SENAI, enquanto iniciava a graduação em Matemática na UNIFEI, combinando a prática com uma base teórica sólida em lógica.",
        "journey3Date": "Atualmente",
        "journey3Title": "Desenvolvedor de Jogos - DEV-U",
        "journey3Desc": "Aplico e expando minhas habilidades como desenvolvedor em um projeto de extensão da UNIFEI focado na criação de jogos, trabalhando de forma colaborativa para transformar ideias em realidade.",
        "journey4Date": "Futuro",
        "journey4Title": "Em Busca de Oportunidades",
        "journey4Desc": "Com uma base técnica e acadêmica sólida, estou preparado e em busca de oportunidades para atuar em projetos desafiadores e inovadores no mercado de desenvolvimento de software."
    },
    "projects": {
        "title": "Meus Projetos",
        "subtitle": "Uma coleção de trabalhos que demonstram minhas habilidades e paixão pelo desenvolvimento.",
        "githubButton": "Ver no GitHub",
        "liveButton": "Ver Ao Vivo",
        "noProjects": "Nenhum projeto com o tópico \"portfolio\" encontrado no meu GitHub.",
        "errorTitle": "Oops! Algo deu errado.",
        "noDescription": "Sem descrição fornecida."
    },
    "skills": {
        "title": "Painel de Habilidades",
        "subtitle": "As tecnologias e ferramentas que utilizo para transformar ideias em realidade.",
        "frontend": "Front-end",
        "frontendHtmlDesc": "Estruturação de páginas web semânticas e acessíveis.",
        "frontendCssDesc": "Estilização e criação de layouts modernos e responsivos.",
        "frontendJsDesc": "Manipulação do DOM, assincronicidade e lógica de programação.",
        "frontendReactDesc": "Criação de interfaces de usuário reativas e componentizadas.",
        "frontendFlutterDesc": "Desenvolvimento de aplicações nativas para múltiplas plataformas.",
        "frontendBootstrapDesc": "Criação de designs responsivos com um framework consolidado.",
        "frontendTailwindDesc": "Estilização rápida e customizável com classes utilitárias.",
        "backend": "Back-end & Databases",
        "backendNodeDesc": "Construção de APIs RESTful eficientes com o ecossistema JavaScript.",
        "backendPhpDesc": "Desenvolvimento de aplicações web dinâmicas do lado do servidor.",
        "backendPythonDesc": "Utilização em scripts, automação e desenvolvimento de back-end.",
        "backendMysqlDesc": "Modelagem e gerenciamento de bancos de dados relacionais.",
        "backendMongoDesc": "Utilização de bancos de dados NoSQL para flexibilidade.",
        "gamedev": "Game Development",
        "gamedevUnityDesc": "Desenvolvimento de jogos 2D e 3D para múltiplas plataformas.",
        "gamedevGodotDesc": "Criação de jogos com uma engine de código aberto e versátil.",
        "gamedevCsharpDesc": "Linguagem principal para scripting de jogos na Unity.",
        "tools": "Ferramentas & Sistemas",
        "toolsGitDesc": "Versionamento de código, colaboração e gerenciamento de projetos.",
        "toolsLinuxDesc": "Uso como ambiente de desenvolvimento e para deploy de servidores.",
        "toolsArduinoDesc": "Prototipagem de projetos de hardware e automação."
    },
    "contact": {
        "title": "Vamos Conversar?",
        "subtitle": "Estou sempre aberto a novas oportunidades e colaborações.",
        "infoTitle": "Informações de Contato",
        "infoText": "Sinta-se à vontade para me contatar por qualquer um dos canais abaixo ou preenchendo o formulário ao lado.",
        "formNameLabel": "Nome",
        "formNamePlaceholder": "Seu Nome",
        "formEmailLabel": "Email",
        "formEmailPlaceholder": "Seu Email",
        "formMessageLabel": "Mensagem",
        "formMessagePlaceholder": "Sua Mensagem",
        "formButton": "Enviar Mensagem",
        "formStatusSending": "Enviando...",
        "formStatusSuccess": "Mensagem enviada com sucesso!",
        "formStatusError": "Ocorreu um erro.",
        "formStatusNetworkError": "Ocorreu um erro de rede. Tente novamente."
    }
}